Revit 2024 API
RebarHandlePositionData Class
 The class that contains data for the handle position calculation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class RebarHandlePositionData : IDisposable
Visual Basic
Public Class RebarHandlePositionData _
	Implements IDisposable
Visual C++
public ref class RebarHandlePositionData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarHandlePositionData
See Also
RebarHandlePositionData Members
Autodesk.Revit.DB.Structure Namespace